step:1 Install & Import Required Libaries

In [4]:
import sqlite3  
import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns
import warnings

warnings.filterwarnings("ignore")

Step:2  create a new SQlite Database and Table

In [13]:
conn = sqlite3.connect("customers_data.db")
cursor = conn.cursor()
cursor.execute("""
CREATE TABLE IF NOT EXISTS customers(
id INTEGER PRIMARY KEY AUTOINCREMENT,
name TEXT,
age INTEGER,
city TEXT,
total_spent REAL
)
""")


conn.commit()

In [20]:
customers = [
("Alice Johnson", 28, "New York", 500.75),
("Bob Smith" , 35, "chicago" , 1200.68),
("Charlie ", 33, "Houston", 989.90),
("David", 22, "San Francisco", 765.70),
("Emma", 32, "Japan", 569.88)
]

cursor.executemany("INSERT INTO customers (name, age, city, total_spent) VALUES(?, ?, ?,?)",customers)

conn.commit()

Run Sql queries:

In [21]:
cursor.execute("ALTER TABLE customers ADD COLUMN total_spent REAL")

OperationalError: duplicate column name: total_spent

In [22]:
query = "SELECT * FROM customers"
df = pd.read_sql(query , conn)

df.head()

   id           name  age           city total_spent_REAL  total_spent
0   1  Alice Johnson   28       New York             None       500.75
1   2      Bob Smith   35        chicago             None      1200.68
2   3       Charlie    33        Houston             None       989.90
3   4          David   22  San Francisco             None       765.70
4   5           Emma   32          Japan             None       569.88

In [26]:
query = "SELECT * FROM customers WHERE total_spent < 700"
pd.read_sql(query, conn)

   id           name  age      city total_spent_REAL  total_spent
0   1  Alice Johnson   28  New York             None       500.75
1   5           Emma   32     Japan             None       569.88
2   6  Alice Johnson   28  New York             None       500.75
3  10           Emma   32     Japan             None       569.88

In [30]:
query = "SELECT AVG(age) AS average_age FROM customers" 
pd.read_sql(query, conn)

   average_age
0         30.0

In [31]:
query = "SELECT city, COUNT(*) AS num_customers FROM customers GROUP BY city" 
pd.read_sql(query, conn)

            city  num_customers
0        Houston              2
1          Japan              2
2       New York              2
3  San Francisco              2
4        chicago              2

In [ ]:
query = "SELECT city, SUM(total_spent) AS total_sales FROM customers GROUP BY city"
df_sales = pd.read_sql(query, conn)

plt.figure(figsize=(8, 5))
sns.barplot(x='city', y='total_sales', data=df_sales, palette='coolwarm')
plt.title("Total Sales by City")
plt.xticks(rotation=45)  # âœ… Corrected spelling
plt.xlabel("City")
plt.ylabel("Total Sales")
plt.tight_layout()
plt.show()